<?php

use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('location_region')->insert([
            ['id' => 100, 'name' => "г.Нур-Султан"],
            ['id' => 101, 'name' => "г.Алматы"],
            ['id' => 102, 'name' => "г.Шымкент"],
            ['id' => 1, 'name' => "Акмолинская область"],
            ['id' => 2, 'name' => "Актюбинская область"],
            ['id' => 3, 'name' => "Алматинская область"],
            ['id' => 4, 'name' => "Атырауская область"],
            ['id' => 5, 'name' => "Западно-Казахстанская область"],
            ['id' => 6, 'name' => "Жамбылская область"],
            ['id' => 7, 'name' => "Карагандинская область"],
            ['id' => 8, 'name' => "Костанайская область"],
            ['id' => 9, 'name' => "Кызылординская область"],
            ['id' => 10, 'name' => "Мангистауская область"],
            ['id' => 11, 'name' => "Туркестанская область"],
            ['id' => 12, 'name' => "Павлодарская область"],
            ['id' => 13, 'name' => "Северо-Казахстанская область"],
            ['id' => 14, 'name' => "Восточно-Казахстанская область"],
        ]);
    }
}
